---
kind: method
id: M:Autodesk.Revit.DB.ParameterMap.ForwardIterator
source: html/8ad1533b-b495-679d-7a7f-1407d692eee0.htm
---
# Autodesk.Revit.DB.ParameterMap.ForwardIterator Method

Retrieve a forward moving iterator to the map.

## Syntax (C#)
```csharp
public virtual ParameterMapIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the map.